import {
  QasidaEntryModel,
  QasidaModel,
  QasidaVerseModel,
} from "@/models/recitation";

export default [
  new QasidaModel({
    title: "",
    entries: [
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic: "لَا إِلَهَ إِلَّا اللَّه (3x)",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "لَا مَعْبُودَ إِلَّا اللَّه",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "لَا إِلَهَ إِلَّا اللَّه (3x)",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "لَا مَقْصُودَ إِلَّا اللَّه",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "لَا إِلَهَ إِلَّا اللَّه (3x)",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "لَا مَوْجُودَ إِلَّا اللَّه",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "لَا إِلَهَ إِلَّا اللَّه (3x)",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "لَا مَشْهُودَ إِلَّا اللَّه",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "اللَّهُمَّ يَا كَافِيَ الْبَلَاء اِكْفِنَا الْبَلَاء قَبْلَ نُزُولِهِ مِنَ السَّمَاء يَا اللَّه يَا اللَّه يَا اللَّه يَا اللَّه يَا اللَّه يَا اللَّه يَا اللَّه (3x)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic: "أَعُوْذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيْم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "﴿ إِنَّ ٱلَّذِينَ سَبَقَتْ لَهُم مِّنَّا ٱلْحُسْنَىٰٓ أُو۟لَٰٓئِكَ عَنْهَا مُبْعَدُونَ ۝ لَا يَسْمَعُونَ حَسِيسَهَا ۖ وَهُمْ فِى مَا ٱشْتَهَتْ أَنفُسُهُمْ خَٰلِدُونَ۝ لَا يَحْزُنُهُمُ ٱلْفَزَعُ ٱلْأَكْبَرُ وَتَتَلَقَّىٰهُمُ ٱلْمَلَٰٓئِكَةُ هَٰذَا يَوْمُكُمُ ٱلَّذِى كُنتُمْ تُوعَدُونَ۝ يَوْمَ نَطْوِى ٱلسَّمَآءَ كَطَىِّ ٱلسِّجِلِّ لِلْكُتُبِ ۚ كَمَا بَدَأْنَآ أَوَّلَ خَلْقٍۢ نُّعِيدُهُۥ ۚ وَعْدًا عَلَيْنَآ ۚ إِنَّا كُنَّا فَٰعِلِينَ۝ وَلَقَدْ كَتَبْنَا فِى ٱلزَّبُورِ مِنۢ بَعْدِ ٱلذِّكْرِ أَنَّ ٱلْأَرْضَ يَرِثُهَا عِبَادِىَ ٱلصَّٰلِحُونَ۝ إِنَّ فِى هَٰذَا لَبَلَٰغًۭا لِّقَوْمٍ عَٰبِدِينَ۝ وَمَآ أَرْسَلْنَٰكَ إِلَّا رَحْمَةًۭ لِّلْعَٰلَمِينَ۝ قُلْ إِنَّمَا يُوحَىٰٓ إِلَىَّ أَنَّمَآ إِلَٰهُكُمْ إِلَٰهٌۭ وَٰحِدٌۭ ۖ فَهَلْ أَنتُم مُّسْلِمُونَ۝ فَإِن تَوَلَّوْا۟ فَقُلْ ءَاذَنتُكُمْ عَلَىٰ سَوَآءٍۢ ۖ وَإِنْ أَدْرِىٓ أَقَرِيبٌ أَم بَعِيدٌۭ مَّا تُوعَدُونَ۝ إِنَّهُۥ يَعْلَمُ ٱلْجَهْرَ مِنَ ٱلْقَوْلِ وَيَعْلَمُ مَا تَكْتُمُونَ۝ وَإِنْ أَدْرِى لَعَلَّهُۥ فِتْنَةٌۭ لَّكُمْ وَمَتَٰعٌ إِلَىٰ حِينٍۢ۝ قَٰلَ رَبِّ ٱحْكُم بِٱلْحَقِّ ۗ وَرَبُّنَا ٱلرَّحْمَٰنُ ٱلْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ ﴾",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "صَدَقَ اللَّهُ الْعَظِيم",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic: "لَا إِلَهَ إِلَّا اللَّه",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "الْفَاتِحَة إِلَى حَضْرَةِ سَيِّدِنَا وَحَبِيبِنَا وَشَفِيعِنَا رَسُولِ اللَّهِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ ﷺ وَسَائِرِ الْأَنْبِيَاءِ وَالْمُرْسَلِينَ وَالْآلِ وَالصَّحْبِ أَجْمَعِينَ وَالتَّابِعِينَ لَهُمْ بِإِحْسَانٍ إِلَى يَوْمِ الدِّينِ وَسَائِرِ عِبَادِ اللَّهِ الصَّالِحِينَ أَنَّ اللَّهَ يُعْلِي دَرَجَاتِهِمْ فِي الْجَنَّةِ وَيَحْمِينَا بِحِمَايَتِهِمْ وَيَمُدَّنَا بِمَدَدِهِمْ وَيُدْخِلنَا فِي شَفَاعَتِهِمْ وَيَنْفَعَنَا بِبَرَكَتِهِمْ وَيَرْزُقَنَا مَحَبَّتَهُمْ وَالتَّخَلُّقَ بِأَخْلَاقِهِمْ وَيَحْشُرَنَا فِي زُمْرَتِهِم فِي عَافِيَة",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "الْفَاتِحَة إِلَى رُوحِ سَيِّدِنَا الْمُهَاجِرِ إِلَى اللَّهِ أَحْمَد بِن عِيسَى وَسَيِّدِنَا عَلِي بِن عَلوِي (خَالِع قَسَم)، وَسَيِّدِنَا الْأُسْتَاذِ الْأَعْظَم الْفَقِيهِ الْمُقَدَّم مُحَمَّد بِن عَلِي بَاعَلوِي، وَسَيِّدِنَا عَلوِي عَمِّ الْفَقِيه، وَسَيِّدِنَا عَبْدِ الرَّحْمَن بِن عَلوِي عَمِّ الْفَقِيه وَإِخْوَانِه، وَسَادَاتِنَا عَلوِي وَعَلِي ابْنَي الْفَقِيه وَإِخْوَانِهِمَا، وَعَلِي وَعَبْدِ اللَّه ابْنَي عَلوِي بِن الْفَقِيه، وَسَيِّدِنَا مُحَمَّد (مَوْلَى الدَّوِيلَه)، وَالشَّيْخ عَبْدِ الرَّحْمَن السَّقَّاف وَأَوْلَادِهِ الشَّيْخ أَبِي بَكر السَّكْرَان وَالشَّيْخ عُمَر الْمِحْضَار وَإِخْوَانِهِمَا، وَالشَّيْخ عَبْدِ اللَّه الْعَيْدَرُوس وَأَوْلَادِهِ أَبِي بَكر الْعَدَنِي وَإِخْوَانِه، وَالشَّيْخ عَلِي بِن أَبِي بَكر وَابْنِهِ عَبْدِ الرَّحْمَن بِن عَلِي وَابْنِهِ أَحْمَد شِهَابِ الدِّين، وَسَيِّدِنَا مُحَمَّد بِن حَسَن جَمَلِ اللَّيْل، وَسَيِّدِنَا مُحَمَّد بِن عَلِي (مَوْلَى عَيْدِيد)، وَسَيِّدِنَا أَبِي بَكر بِن عَبْدِ اللَّه بَاشَمَيلَه، وَالشَّيْخ أَبِي بَكر بِن سَالِم، وَسَيِّدِنَا عُمَر الْعَطَّاس، وَالْحَبِيب عَبْدِ اللَّه الْحَدَّاد، وَالْحَبِيب عُمَر الْبَار، وَالْحَبِيب عَبْدِ الرَّحْمَن ابن عَبْدِ اللَّه بَلْفَقِيه، وَالْحَبِيب مُحَمَّد وَعُمَر ابْنَي زَيْن بِن سُمَيُط، وَالْحَبِيب أَحْمَد بِن عُمَر بِن سُمَيْط، وَالْحَبِيب حَامِد بِن عُمَر، وَسَيِّدِنَا طَاهِر وَعَبْدِ اللَّه ابْنَي حُسَيْن بِن طَاهِر، وسيِّدنا أَحْمَد بِن مُحَمَّد الْمِحْضَار، وَسَيِّدِنَا أَبُو بَكر ابن عَبْدِ اللَّه الْعَطَّاس، وَسَيِّدِنَا أَحْمَد بِن حَسَن الْعَطَّاس، وَسَيِّدِنَا عَيْدَرُوس بِن عُمَر الْحَبَشِي، وَسَيِّدِنَا عَلِي بِن مُحَمَّد الْحَبَشِي، وَالْحَبِيب عَبْدِ اللَّه بِن شَيْخ الْعَيْدَرُوس، وَالْحَبِيب أَحْمَد بِن عَيْدَرُوس الْعَيْدَرُوس، وَالْحَبِيب عَبْدِ الرَّحْمَن الْمَشْهُور وَابْنِهِ عَلِي وَابْنِهِ عَبْدِ اللَّه ابن عَلِي الْمَشْهُور وَالْحَبِيب سَالِم بِن حَفِيظ وَابْنِهِ الْحَبِيب مُحَمَّد، وَالْحَبِيب عَلوِي بِن عَبْدِ الرَّحْمَن الْمَشْهُور، وَالْحَبِيب عَبْدِ اللَّه بِن عُمَر الشَّاطِرِي وَالْحَبِيب عَلوِي بِن عَبْدِ اللَّه بِن شِهَابِ الدِّين وَابْنِهِ مُحَمَّد بِن عَلوِي، وَالْحَبِيب أَبِي بَكر عَطَّاس الْحَبَشِي، وَالْحَبِيب أَحْمَد مَشْهُور الْحَدَّاد؛ وَجَمِيعِ سَادَاتِنَا آلِ أَبِي عَلوِي، وَالشَّيْخ سَعِيد الْعَمُودِي، وَالشَّيْخ سَالِم بِن فَضل بَافَضل، وَالشَّيْخ عَلِي ابن مُحَمَّد الْخَطِيب، وَالشَّيْخ سَعْد بِن عَلِي مَدحَج، وَالشَّيْخ عَبْدِ اللَّه بِن أَحْمَد بَاسَوْدَان، وَأُصُولِهِم وَفُرُوعِهِم وَذُرِّيَّاتِهِم وَذَوِي الْحُقُوقِ عَلَيْهِم أَجْمَعِين، وَمَشَايِخِ الْحَضْرَةِ الْجَمِيع، وَوَالِدِينَا، وَأَوْلَادِنَا، وَأَهْلِينَا، وَمَشَايِخِنَا، وَمُعَلِّمِينَا، وَجَمِيعِ الْمُسْلِمِينَ أَنَّ اللَّهَ يُعْلِي دَرَجَاتِهِم فِي الْجَنَّة، وَيَغْفِرُ لَهُم وَيَرْحَمُهُم وَيُسْكِنُهُمُ الْجَنَّة",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "الْفَاتِحَة لِأَصْحَابِ الْقَهْوَةِ وَالْبَخُورِ وَالْكَرَامَةِ وَمَنْ جَاءَ مِنْهُ خَيْرٌ أَوْ وَصَلَنَا بِخَيْرٍ وَمَنْ كَانَ سَبَبًا لِهَذَا الْجَمْعِ الْعَظِيمِ وَالْقُرَّاءِ وَالْمُسْتَمِعِينَ أَنَّ اللَّهَ يُجَمِّلُ أَحْوَالَهُم وَيَكُونُ فِي عَوْنِهِم وَيَتَقَبَّلُ مِنْهُم وَيَغْفِرُ لِوَالِدِيهِم وَوَالِدِينَا وَلِجَمِيعِ الْمُسْلِمِين وَيَجْمَعُ قُلُوبَنَا عَلَى التَّقْوَى، وَيَحْفَظُنَا وَإِيَّاهُم مِنْ كُلِّ أَذىً وَبَلْوَى، مَعَ الْعَافِيَةِ الدَّائِمَةِ التَّامَّة",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "الْفَاتِحَة بِبَرَكَةِ هَذِهِ الْحَضْرَةِ الشَّرِيفَةِ وَهَؤُلَاءِ السَّادَةِ الْأَنْجَابِ أَنَّ اللَّهَ يُصْلِحُ الْإِمَامَ وَالْأُمَّةَ وَالرَّاعِيَ وَالرَّعِيَّةَ وَيُفَرِِّجُ عَلَى الْمُسْلِمِينَ وَيَرْحَمُهُم بِرَحْمَةٍ هَنِيئَةٍ مَرِيئَةٍ نَافِعَةٍ وَيَطْرَحُ فِيهَا الْخَيْرَ وَالْبَرَكَةَ وَيُعَجِّلُ بِهَا وَيُصْلِحُ السَّادَةَ الْعَلَوِيَّة وَيَغْفِرُ ذُنُوبَنَا وَيَسْتُرُ عُيُوبَنَا وَيُسَهِّلُ مَطْلُوبَنَا وَيُحَسِّنُ أَخْلَاقَنَا وَيُوَسِّعُ مِنَ الْحَلَالِ أَرْزَاقَنَا وَيَكْفِينَا شَرَّ الْأَذِيَّاتِ وَالْبَلِيَّاتِ وَيُطْفِيءُ نَارَ الْفِتَنِ وَالْمِحَنِ، مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ، وَيُطِيلُ أَعْمَارَنَا فِي طَاعَتِهِ وَمَحَبَّتِهِ وَرِضَاهُ، وَيَمُنُّ عَلَيْنَا بِكَمَالِ مَحَبَّتِهِ وَمَحَبَّةِ نَبِيِّهِ سَيِّدِنَا مُحَمَّدٍ ﷺ، وَاتِّبَاعِ شَرِيعَتِهِ وَالْاِهْتِدَاءِ وَالْاِقْتِدَاءِ بِهِ وَبِسَلَفِنَا الصَّالِحِينَ، وَأَنَّ اللَّهَ يُعْطِي كُلَّ سَائِلٍ مِنَّا وَمِنْكُم سُؤلَهُ وَمَأْمُولَهُ، عَلَى مَا يُرْضِي اللَّهَ وَرَسُولَهُ، وَيَهَبُ لَنَا كُلَّ خَيْرٍ وَيُعَامِلُنَا مُعَامَلَةَ أَهْلِ الْخَيْرِ، وَيَعُمّ بَرَكَة هَذِهِ الْحَضْرَةِ عَلَى الْمُسْلِمِينَ أَجْمَعِينَ وَيَتَقَبَّلُهُ مِنَّا وَيَقْبَلُنَا عَلَى مَا فِينَا، وَيَمُنّ عَلَى الْجَمِيعِ بِكَامِلِ حُسْنِ السَّابِقَةِ وَحُسْنِ الْخَاتِمَةِ عِنْدَ الْمَوْتِ فِي خَيْرٍ وَلُطْفٍ وَعَافِيَةٍ، وَإِلَى حَضْرَةِ النَّبِيِّ سَيِّدِنَا مُحَمَّدٍ ﷺ",
            translit: "",
            translation: "",
          }),
        ],
      }),
    ],
  }),
];
