import {
  QasidaEntryModel,
  QasidaModel,
  QasidaVerseModel,
} from "@/models/recitation";

export default [
  new QasidaModel({
    title: "",
    entries: [
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلَّ عَلَيْهِ وَسَلِّمْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "مَا لَاحَ فِي الْأُفْقِ نُورُ كَوْكَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "اَلْفَاتِحِ الْخَاتِمِ الْمُقَرَّبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "اَلْمُصْطَفَى الْمُجْتَبَى الْمُحَبَّبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "مَا لَاحَ بَدْرٌ وَغَابَ غَيْهَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "مَا رِيحُ نَصْرٍ بِالنَّصْرِ قَدْ هَبّْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "مَا سَارَتِ الْعِيسُ بَطْنَ سَبْسَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَكُلِّ مَنْ لِلْحَبِيبِ يُنْسَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَكُلِّ مَنْ لِلنَّبِيِّ يَصْحَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَاغْفِرْ وَسَامِحْ مَنْ كَانَ أَذْنَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَبَلِّغِ الْكُلَّ كُلَّ مَطْلَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَاسْلُكْ بِنَا رَبِّ خَيْرَ مَذْهَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَاصْلِحْ وَسَهِّلْ مَا قَدْ تَصَعَّبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَعْلَى الْبَرَايَا جَاهًا وَأَرْحَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَصْدَقِ عَبْدٍ بِالْحَقِّ أَعْرَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "خَيْرِ الْوَرَى مَنْهَجًا وَأَصْوَبْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "مَا طَيْرُ يُمْنٍ غَنَّى فَأَطْربْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَيْهْ وَسَلِّمْ",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَشْرَفِ بَدْرٍ  فِي الْكَوْنِ أَشْرَقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَكْرَمِ دَاعٍ يَدْعُو إِلَى الْحَقّْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "اَلْمُصْطَفَى الصَّادِقِ الْمُصَدَّقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَحْلَى الْوَرَى مَنْطِقًا وَأَصْدَقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَفْضَلِ مَنْ بِالتُّقَى تَحَقَّقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "مَنْ بِالسَّخَا وَالْوَفَا تَخَلَّقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَاجْمَعْ مِنَ الشَّمْلِ مَا تَفَرَّقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَاصْلِحْ وَسَهِّلْ مَا قَدْ تَعَوَّقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَافْتَحْ مِنَ الْخَيْرِ كُلَّ مُغْلَقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَآلِهْ وَمَنْ بِالنَّبِي تَعَلَّقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَآلِهْ وَمَنْ لِلْحَبِيبِ يَعْشَقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَمَنْ بِحَبْلِ النَّبِي تَوَثَّقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَيْهْ وَسَلِّمْ",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "مَا لَاحَ فِي الْأُفْقِ لَمْعُ بَارِقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "خَيْرِ الْوَرَى أَشْرَفِ الْخَلَائِقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَصْدَقِ عَبْدٍ بِالْحَقِّ نَاطِقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَبْهَرِ نُورٍ فِي الْكَوْنِ شَارِقْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَى مُحَمَّد",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَبِّ صَلِّ عَلَيْهْ وَسَلِّمْ",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic: "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "ٱلْحَمْدُ لِلَّهِ الْقَوِيِّ سُلْطَانُه، الوَاضِحِ بُرْهَانُه، المَبْسُوطِ فِي الْوُجُودِ كَرَمُهُ وَإِحْسَانُه * تَعَالَى مَجْدُهُ وَعَظُمَ شَأْنُه، خَلَقَ الْخَلْقَ لِحِكْمَة، وَطَوَى عَلَيْهَا عِلْمَه، وَبَسَطَ لَهُمْ مِنْ فَائِضِ الْمِنَّةِ مَا جَرَتْ بِهِ فِي أَقْدَارِهِ الْقِسْمَة * فَأَرْسَلَ إِلَيْهِمْ أَشْرَفَ خَلْقِهِ وَأَجَلَّ عَبِيدِهِ رَحْمَة، تَعَلَّقَتْ إِرَادَتُهُ الْأَزَلِيَّةُ بِخَلْقِ هَذَا الْعَبْدِ الْمَحْبُوب، فَانْتَشَرَتْ آثَارُ شَرَفِهِ فِي عَوَالِمِ الشَّهَادَةِ وَالْغُيُوب * فَمَا أَجَلَّ هَذَا الْمَنَّ الَّذِي تَكَرَّمَ بِهِ الْمَنَّان، وَمَا أَعْظَمَ هَذَا الْفَضْلَ الَّذِي بَرَزَ مِنْ حَضْرَةِ الْإِحْسَان، صُورَةً كَامِلَةً ظَهَرَتْ فِي هَيْكَلٍ مَحْمُود، فَتَعَطَّرَتْ بِوُجُودِهَا أَكْنَافُ الْوُجُود، وَطَرَّزَتْ بُرْدَ الْعَوَالِمِ بِطِرَازِ التَّكْرِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "تَجَلَّى الْحَقُّ فِي عَالَمِ قُدْسِهِ الْوَاسِع، تَجَلِّيًا قَضَى بِانْتِشَارِ فَضْلِهِ فِي الْقَرِيبِ وَالشَّاسِع * فَلَهُ الْحَمْدُ الَّذِي لَا تَنْحَصِرُ أَفْرَادُهُ بِتَعْدَاد، وَلَا يُمَلُّ تَكْرَارُهُ بِكَثْرَةِ تَرْدَاد * حَيْثُ أَبْرَزَ مِنْ عَالَمِ الْإِمْكَان، صُورَةَ هَذَا الْإِنْسَان، لِيَتَشَرَّفَ بِوُجُودِهِ الثَّقَلَان، وَتَنْتَشِرَ أَسْرَارُهُ فِي الْأَكْوَان * فَمَا مِنْ سِرٍّ اتَّصَلَ بِهِ قَلْبُ مُنِيب، إِلَّا مِنْ سَوَابِغِ فَضْلِ اللَّهِ عَلَى هَذَا الْحَبِيب",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَالَقَلْبٍ سُرُورُهُ قَدْ تَوَالَى",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "بِحَبِيبٍ عَمَّ الْأَنَامَ نَوَالَا",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "جَلَّ مَنْ شَرَّفَ الْوُجُودَ بِنُورٍ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "غَمَرَ الْكَوْنَ بَهْجَةً وَجَمَالَا",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "قَدْ تَرَقَّى فِي الْحُسْنِ أَعْلَى مَقَامٍ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَتَنَاهَى فِي مَجْدِهِ وَتَعَالَى",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "لَاحَظَتْهُ الْعُيُونُ فِيمَا اجْتَلَتْهُ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "بَشَرًا كَامِلًا يُزِيحُ الضَّلَالَا",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَهْوَ مِنْ فَوْقِ عِلْمِ مَا قَدْ رَأَتْهُ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "رِفْعَةً فِي شُؤُونِهِ وَكَمَالَا",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "فَسُبْحَانَ الَّذِي أَبْرَزَ مِنْ حَضْرَةِ الْاِمْتِنَان، مَا يَعْجِزُ عَنْ وَصْفِهِ اللِّسَان، وَيَحَارُ فِي تَعَقُّلِ مَعَانِيهِ الْجَنَان * اِنْتَشَرَ مِنْهُ فِي عَالَمِ الْبُطُونِ وَالظُّهُور، مَا مَلَأَ الْوُجُودَ الْخَلْقِيَّ نُور، فَتَبَارَكَ اللَّهُ مِنْ إِلَهٍ كَرِيم، بَشَّرَتْنَا آيَاتُهُ فِي الذِّكْرِ الْحَكِيم، بِبشَارَةِ: ﴿ لَقَدْ جَآءَكُمْ رَسُولٌ مِّنْ أَنفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُم بِٱلْمُؤْمِنِينَ رَءُوفٌ رَّحِيمٌ ۝ فَإِن تَوَلَّوْا۟ فَقُلْ حَسْبِىَ ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ ٱلْعَرْشِ ٱلْعَظِيمِ ﴾ * فَمَنْ فَاجَأَتْهُ هَذِهِ الْبِشَارَةُ وَتَلَقَّاهَا بِقَلْبٍ سَلِيم، فَقَدْ هُدِيَ إِلَى صِرَاطٍ مُسْتَقِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا ٱللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ شَهَادَةً يُعْرِبُ بِهَا اللِّسَان، عَمَّا تَضَمَّنَهُ الْجَنَان، مِنَ التَّصْدِيقِ بِهَا وَالْإِذْعَان * تَثْبُتُ بِهَا فِي الصُّدُورِ مِنَ الْإِيمَانِ قَوَاعِدُه، وَتَلُوحُ عَلَى أَهْلِ الْيَقِينِ مِنْ سِرِّ ذٰلِكَ الْإِذْعَانِ وَالتَّصْدِيقِ شَوَاهِدُه * وَأَشْهَدُ أَنَّ سَيِّدَنَا مُحَمَّدًا الْعَبْدَ الصَّادِقَ فِي قَوْلِهِ وَفِعْلِه، وَالْمُبَلِّغَ عَنِ اللَّهِ مَا أَمَرَهُ بِتَبْلِيغِهِ لِخَلْقِهِ مِنْ فَرْضِهِ وَنَفْلِه * عَبْدٌ أَرْسَلَهُ اللَّهُ لِلْعَالَمِينَ بَشِيرًا وَنَذِيرًا، فَبَلَّغَ الرِّسَالَة، وَأَدَّى الْأَمَانَة، وَهَدَى اللَّهُ بِهِ مِنَ الْأُمَّةِ بَشَرًا كَثِيرًا * فَكَانَ فِي ظُلْمَةِ الْجَهْلِ لِلْمُسْتَبْصِرِينَ سِرَاجًا وَقَمَرًا مُنِيرًا، فَمَا أَعْظَمَهَا مِنْ مِنَّةٍ تَكَرَّمَ اللَّهُ بِهَا عَلَى الْبَشَر، وَمَا أَوْسَعَهَا مِنْ نِعْمَةٍ انْتَشَرَ سِرُّهَا فِي الْبَحْرِ وَالْبَرّ * اللَّهُمَّ صَلِّ وَسَلِّمْ بِأَجَلِّ الصَّلَوَاتِ وَأَجْمَعِهَا، وَأَزْكَى التَّحِيَّاتِ وَأَوْسَعِهَا، عَلَى هَذَا الْعَبْدِ الَّذِي وَفَّى بِحَقِّ الْعُبُودِيَّة، وَبَرَزَ فِيهَا فِي خِلْعَةِ الْكَمَال، وَقَامَ بِحَقِّ الرُّبُوبِيَّةِ فِي مَوَاطِنِ الْخِدْمَةِ لِلَّهِ وَأَقْبَلَ عَلَيْهِ غَايَةَ الْإِقْبَال * صَلَاةً يَتَّصِلُ بِهَا رُوحُ الْمُصَلِّي عَلَيْهِ بِه، فَيَنْبَسِطُ فِي قَلْبِهِ نُورُ سِرِّ تَعَلُّقِهِ بِهِ وَحُبِّه، وَيُكْتَبُ بِهَا بِعِنَايَةِ اللَّهِ فِي حِزْبِه، وَعَلَى آلِهِ وَصَحْبِه * الَّذِينَ ارْتَقَوْا صَهْوَةَ الْمَجْدِ بِقُرْبِه، وَتَفَيَّؤُوا ظِلَالَ الشَّرَفِ الْأَصْلِيِّ بِوُدِّهِ وَحُبِّه، مَا عَطَّرَ الْأَكْوَانَ بِنَشْرِ ذِكْرَاهُمْ نَسِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "أَمَّا بَعْدُ: فَلَمَّا تَعَلَّقَتْ إِرَادَةُ اللَّهِ فِي الْعِلْمِ الْقَدِيم، بِظُهُورِ أَسْرَارِ التَّخْصِيصِ لِلْبَشَرِ الْكَرِيم، بِالتَّقْدِيمِ وَالتَّكْرِيم * نَفَذَتِ الْقُدْرَةُ الْبَاهِرَة، بِالنِّعْمَةِ الْوَاسِعَةِ وَالْمِنَّةِ الْغَامِرَة * فَانْفَلَقَتْ بَيْضَةُ التَّصْوِير، فِي الْعَالَمِ الْمُطْلَقِ الْكَبِير، عَنْ جَمَالٍ مَشْهُودٍ بِالْعَيْن، حَاوٍ لِوَصْفِ الْكَمَالِ الْمُطْلَقِ وَالْحُسْنِ التَّامِّ وَالزَّيْن * فَتَنَقَّلَ ذَلِكَ الْجَمَالُ الْمَيْمُون، فِي الْأَصْلَابِ الْكَرِيمَةِ وَالْبُطُون، فَمَا مِنْ صُلْبٍ ضَمَّه، إِلَّا وَتَمَّتْ عَلَيْهِ مِنَ اللَّهِ النِّعْمَة * فَهُوَ الْقَمَرُ التَّامُّ الَّذِي يَتَنَقَّلُ فِي بُرُوجِه، لِيَتَشَرَّفَ بِهِ مَوْطِنُ اسْتِقْرَارِهِ وَمَوْضِعُ خُرُوجِه * وَقَدْ قَضَتِ الْأَقْدَارُ الْأَزَلِيَّةُ بِمَا قَضَتْ، وَأَظْهَرَتْ مِنْ سِرِّ هَذَا النُّورِ مَا أَظْهَرَتْ، وَخَصَّصَتْ بِهِ مَنْ خَصَّصَتْ * فَكَانَ مُسْتَقَرُّهُ فِي الْأَصْلَابِ الْفَاخِرَة، وَالْأَرْحَامِ الشَّرِيفَةِ الطَّاهِرَة * حَتَّى بَرَزَ فِي عَالَمِ الشَّهَادَةِ بَشَرًا لَا كَالْبَشَر، وَنُورًا حَيَّرَ الْأَفْكَارَ ظُهُورُهُ وَبَهَر * فَتَعَلَّقَتْ هِمَّةُ الرَّاقِمِ لِهَذِهِ الْحُرُوف، بِأَنْ يَرْقُمَ فِي هَذَا الْقِرْطَاسِ مَا هُوَ لَدَيْهِ مِنْ عَجَائِبِ ذَلِكَ النُّورِ مَعْرُوف * وَإِنْ كَانَتِ الْأَلْسُنُ لَا تَفِي بِعُشْرِ مِعْشَارِ أَوْصَافِ ذَلِكَ الْمَوْصُوف، تَشْوِيقًا لِلسَّامِعِين، مِنْ خَوَاصِّ الْمُؤْمِنِين، وَتَرْوِيحًا لِلْمُتَعَلِّقِينَ بِهَذَا النُّورِ الْمُبِين * وَإِلَّا فَأَنَّى تُعْرِبُ الْأَقْلَام، عَنْ شُؤُونِ خَيْرِ الْأَنَام، وَلٰكِنْ هَزَّنِي إِلَى تَدْوِينِ مَا حَفِظْتُهُ مِنْ سِيَرِ أَشْرَفِ الْمَخْلُوْقِين، وَمَا أَكْرَمَهُ اللَّهُ بِهِ فِي مَوْلِدِهِ مِنَ الْفَضْلِ الَّذِي عَمَّ الْعَالَمِين * وَبَقِيَتْ رَايَتُهُ فِي الْكَوْنِ مَنْشُوْرَةً عَلَى مَرِّ الْأَيَّامِ وَالشُّهُورِ وَالسِّنِين، دَاعِي التَّعَلُّقِ بِهَذِهِ الْحَضْرَةِ الْكَرِيمَة، وَلَاعِجُ التَّشَوُّقِ إِلَى سَمَاعِ أَوْصَافِهَا الْعَظِيمَة * وَلَعَلَّ اللَّهَ يَنْفَعُ بِهِ الْمُتَكَلِّمَ وَالسَّامِع، فَيَدْخُلَانِ فِي شَفَاعَةِ هذَا النَّبِيِّ الشَّافِع، وَيَتَرَوَّحَانِ بِرَوْحِ ذٰلِكَ النَّعِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "وَقَدْ آنَ لِلْقَلَمِ أَنْ يَخُطَّ مَا حَرَّكَتْهُ فِيهِ الْأَنَامِل، مِمَّا اسْتَفَادَهُ الْفَهْمُ مِنْ صِفَاتِ هَذَا الْعَبْدِ الْمَحْبُوبِ الْكَامِل، وَشَمَائِلِهِ الَّتِي هِيَ أَحْسَنُ الشَّمَائِل * وَهُنَا حَسُنَ أَنْ نُثْبِتَ مَا بَلَغَ إِلَيْنَا فِي شَأْنِ هَذَا الْحَبِيبِ مِنْ أَخْبَارٍ وَآثَار، لِيَتَشَرَّفَ بِكِتَابَتِهِ الْقَلَمُ وَالْقِرْطَاسُ وَتَتَنَزَّهَ فِي حَدَائِقِهِ الْأَسْمَاعُ وَالْأَبْصَار * وَقَدْ بَلَغَنَا فِي الْأَحَادِيثِ الْمَشْهُورَة، أَنَّ أَوَّلَ شَيْءٍ خَلَقَهُ اللَّهُ هُوَ النُّورُ الْمُوْدَعُ فِي هَذِهِ الصُّورَة * فَنُورُ هَذَا الْحَبِيبِ أَوَّلُ مَخْلُوقٍ بَرَزَ فِي الْعَالَم، وَمِنْهُ تَفَرَّعَ الْوُجُودُ خَلْقًا بَعْدَ خَلْقٍ فِيمَا حَدَثَ وَمَا تَقَادَم * وَقَدْ أَخْرَجَ عَبْدُ الرَّزَّاقِ بِسَنَدِهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ - رَضِيَ اللَّهُ عَنْهُمَا- قَالَ: قُلْتُ يَا رَسُوْلَ اللَّهِ بِأَبِي وَأُمِّي، أَخْبِرْنِي عَنْ أَوَّلِ شَيْءٍ خَلَقَهُ اللَّهُ قَبْلَ الْأَشْيَاء، قَالَ: {يَا جَابِرُ! إِنَّ اللَّهَ خَلَقَ قَبْلَ الْأَشْيَاءِ نُورَ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ مِنْ نُورِه} * وَقَدْ وَرَدَ مِنْ حَدِيثِ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمْ: {كُنْتُ أَوَّلَ النَّبِيِّينَ فِي الْخَلْقِ وَآخِرَهُمْ فِي الْبَعْث} * وَقَدْ تَعَدَّدَتِ الرِّوَايَاتُ بِأَنَّهُ أَوَّلُ الْخَلْقِ وُجُودًا، وَأَشْرَفُهُمْ مَوْلُودًا * وَلَمَّا كَانَتِ السَّعَادَةُ الْأَبَدِيَّة، لَهَا مُلَاحَظَةٌ خَفِيَّة، اخْتَصَّتْ مَنْ شَاءَتْ مِنَ الْبَرِيَّة، بِكَمَالِ الْخُصُوصِيَّة * فَاسْتَوْدَعَتْ هَذَا النُّورَ الْمُبِين، أَصْلَابَ وَبُطُونَ مَنْ شَرَّفَتْهُ مِنَ الْعَالَمِين، فَتَنَقَّلَ هَذَا النُّورُ مِنْ صُلْبِ آدَمَ وَنُوحٍ وَإِبْرَاهِيم * حَتَّى أَوْصَلَتْهُ يَدُ الْعِلْمِ الْقَدِيم، إِلَى مَنْ خَصَّصَتْهُ بِالتَّكْرِيمِ أَبِيهِ الْكَرِيم، عَبْدِ اللَّهِ بْنِ عَبْدِ الْمُطَّلِبِ ذِي الْقَدْرِ الْعَظِيم * وَأُمِّهُ الَّتِي هِيَ فِي الْمَخَاوِفِ آمِنَة، السَّيِّدَةِ الْكَرِيمَةِ آمِنَة * فَتَلَقَّاهُ صُلْبُ عَبْدِ اللَّهِ فَأَلْقَاهُ إِلَى بَطْنِهَا، فَضَمَّتْهُ أَحْشَاؤُهَا بِمَعُونَةِ اللَّهِ مُحَافَظَةً عَلَى حَقِّ هَذِهِ الدُّرَّةِ وَصَوْنِهَا * فَحَمَلَتْهُ بِرِعَايَةِ اللَّهِ كَمَا وَرَدَ عَنْهَا حَمْلًا خَفِيفًا لَا تَجِدُ لَهُ ثِقَلًا، وَلَا تَشْكُو مِنْهُ أَلَمًا وَلَا عِلَلًا * حَتَّى مَرَّ الشَّهْرُ بَعْدَ الشَّهْرِ مِنْ حَمْلِه، وَقَرُبَ وَقْتُ بُرُوزِهِ إِلَى عَالَمِ الشَّهَادَةِ لِتَنْبَسِطَ عَلَى أَهْلِ هَذَا الْعَالَمِ فُيُوضَاتُ فَضْلِه، وَتَنْتَشِرَ فِيهِ آثَارُ مَجْدِهِ الصَّمِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "وَمُنْذُ عَلِقَتْ بِهِ هَذِهِ الدُّرَّةُ الْمَكْنُونَة، وَالْجَوْهَرَةُ الْمَصُونَة، وَالْكَوْنُ كُلُّهُ يُصْبِحُ وَيُمْسِي فِي سُرُورٍ وَابْتِهَاج، بِقُرْبِ ظُهُورِ إِشْرَاقِ هَذَا السِّرَاج * وَالْعُيُونُ مُتَشَوِّفَةٌ إِلَى بُرُوزِه، مُتَشَوِّقَةٌ إِلَى الْتِقَاطِ جَوَاهِرِ كُنُوزِه * وَكُلُّ دَابَّةٍ لِقُرَيْشٍ نَطَقَتْ بِفَصِيحِ الْعِبَارَة، مُعْلِنَةً بِكَمَالِ الْبِشَارَة * وَمَا مِنْ حَامِلٍ حَمَلَتْ فِي ذٰلِكَ الْعَام، إِلَّا أَتَتْ فِي حَمْلِهَا بِغُلَام، مِنْ بَرَكَاتِ وَسَعَادَةِ هٰذَا الْإِمَام * وَلَمْ تَزَلِ الْأَرْضُ وَالسَّمٰوَات، مُتَضَمِّخَةً بِعِطْرِ الْفَرَحِ بِمُلَاقَاةِ أَشْرَفِ الْبَرِيَّات، وَبُرُوزِهِ مِنْ عَالَمِ الْخَفَاءِ إِلَى عَالَمِ الظُّهُور، بَعْدَ تَنَقُّلِهِ فِي الْبُطُونِ وَالظُّهُور * فَأَظْهَرَ اللَّهُ فِي الْوُجُودِ بَهْجَةَ التَّكْرِيم، وَبَسَطَ فِي الْعَالَمِ الْكَبِيرِ مَائِدَةَ التَّشْرِيفِ وَالتَّعْظِيم، بِبُرُوزِ هٰذَا الْبَشَرِ الْكَرِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "فَحِينَ قَرُبَ أَوَانُ وَضْعِ هَذَا الْحَبِيب، أَعْلَنَتِ السَّمَوَاتُ وَالْأَرَضُونَ وَمَنْ فِيهِنَّ بِالتَّرْحِيب * وَأَمْطَارُ الْجُودِ الْإِلٰهِيِّ عَلَى أَهْلِ الْوُجُودِ تَثِجّ، وَأَلْسِنَةُ الْمَلَائِكَةِ بِالتَّبْشِيرِ لِلْعَالَمِينَ تَعِجّ * وَالْقُدْرَةُ كَشَفَتْ قِنَاعَ هٰذَا الْمَسْتُور، لِيَبْرُزَ نُورُهُ كَامِلًا فِي عَالَمِ الظُّهُور، نُورًا فَاقَ كُلَّ نُور * وَأَنْفَذَ الْحَقُّ حُكْمَه، عَلَى مَنْ أَتَمَّ اللَّهُ عَلَيْهِ النِّعْمَة، مِنْ خَوَاصِّ الْأُمَّة، أَنْ يَحْضُرَ عِنْدَ وَضْعِهِ أُمَّه * تَأْنِيسًا لِجَنَابِهَا الْمَسْعُود، وَمُشَارَكَةً لَهَا فِي هٰذَا السِّمَاطِ الْمَمْدُود * فَحَضَرَتْ بِتَوْفِيقِ اللَّهِ السَّيِّدَةُ مَرْيَمُ وَالسَّيِّدَةُ آسِيَة، وَمَعَهُمَا مِنَ الْحُورِ الْعِينِ مَنْ قَسَمَ اللَّهُ لَهُ مِنَ الشَّرَفِ بِالْقِسْمَةِ الْوَافِيَة * فَأَتَى الْوَقْتُ الَّذِي رَتَّبَ اللَّهُ عَلَى حُضُورِهِ وُجُودَ هٰذَا الْمَوْلُود، فَانْفَلَقَ صُبْحُ الْكَمَالِ مِنَ النُّورِ عَنْ عَمُود، وَبَرَزَ الْحَامِدُ الْمَحْمُود، مُذْعِنًا لِلَّهِ بِالتَّعْظِيمِ وَالسُّجُود",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic: "أَشْرَقَ الْكَوْنُ ابْتِهَاجًا",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "بِوُجُودِ الْمُصْطَفَى احْمَدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَلِأَهْلِ الْكَوْنِ أُنْـسٌ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَسُرُورٌ قَـدْ تَجَـدَّدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "فَاطْرَبُوا يَا اهْلَ الْمَثَانِي",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "فَهَزَارُ الْيُمْـنِ غَرَّدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَاسْتَضِيئُوا بِجَمَالٍ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "فَاقَ فِي الْحُسْنِ تَفَـَّردْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَلَنَا الْبُشْـرَى بِسَعْـدٍ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "مُسْتَمِرٍّ لَيْـسَ يَنْفَدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "حَيْثُ أُوتِينَـا عَطَـاءً",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "جَمَعَ الْفَخْـرَ الْمُؤَبَّدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "فَلِرَبِّي كُـلُّ حَـمْـدٍ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "جَلَّ أَنْ يَحْصُرَهُ الْعَـدّْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "إِذْ حَبَانَا بوُجُودِ الْـ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "ـمُصْطَفَى الْهَادِي مُحَمَّدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَا رَسُولَ اللَّهِ أَهْـلًا",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "بِكَ إِنَّا بِكَ نُسْعَـدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَبِجَاهِـهْ يَا إِلٰهِـي",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "جُدْ وَبَلِّغْ كُلَّ مَقْصَـدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَاهْدِنَا نَهْجَ سَبِيلِه",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "كَيْ بِه نُسْعَدْ وَنُرْشَـدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "رَبِّ بَلِّغْنَا بِجَاهِـه",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "فِي جِوَارِهْ خَيْرَ مَقْعَـدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَصَـلَاةُ اللَّهِ تَغْشَـى",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَشْرَفَ الرُّسْلِ مُحَمَّـدْ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَسَلَامٌ مُسْتَـمِـرٌّ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "كُلَّ حِينٍ يَتَجَدَّدْ",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "وَحِينَ بَرَزَ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ مِنْ بَطْنِ أُمِّهِ بَرَزَ رَافِعًا طَرْفَهُ إِلَى السَّمَا، مُومِيًا بِذٰلِكَ الرَّفْعِ إِلَى أَنَّ لَهُ شَرَفًا عَلَا مَجْدُهُ وَسَمَا * وَكَانَ وَقْتُ مَوْلِدِ سَيِّدِ اْلكَوْنَيْن، مِنَ الشُّهُورِ شَهْرَ رَبِيعٍ الْأَوَّلِ، وَمِنَ الْأَيَّامِ يَوْمَ الْاِثْنَين، وَمَوْضِعُ وِلَادَتِهِ وَقَبْرِهِ بِالْحَرَمَيْن * وَقَدْ وَرَدَ أَنَّهُ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ وُلِدَ مَخْتُونًا مَكْحُولًا مَقْطُوعَ السُّرَّة، تَوَلَّتْ ذَلِكَ لِشَرَفِهِ عِنْدَ اللَّهِ أَيْدِي الْقُدْرَة * وَمَعَ بُرُوزِهِ إِلَى هٰذَا اْلعَالَمِ ظَهَرَ مِنَ الْعَجَائِب، مَا يَدُلُّ عَلَى أَنَّهُ أَشْرَفُ الْمَخْلُوقِينَ وَأَفْضَلُ الْحَبَائِب * فَقَدْ وَرَدَ عَنْ عَبْدِ الرَّحْمٰنِ بْنِ عَوْفٍ عَنْ أُمِّهِ الشَّفَّاءِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَتْ: لَمَّا وَلَدَتْ آمِنَةُ رَضِيَ اللَّهُ عَنْهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ وَقَعَ عَلَى يَدَيَّ فَاسْتَهَلَّ، فَسَمِعْتُ قَائِلًا يَقُولُ: رَحِمَكَ اللَّهُ، أَوْ: رَحِمَكَ رَبُّكَ * قَالَتِ الشَّفَّاءُ: فَأَضَاءَ لَهُ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِب، حَتَّى نَظَرْتُ إِلَى بَعْضِ قُصُورِ الرُّوم * قَالَتْ: ثُمَّ أَلْبَسْتُهُ وَأَضْجَعْتُهُ، فَلَمْ أَنْشَبْ أَنْ غَشِيَتْنِي ظُلْمَةٌ وَرُعْبٌ وَقُشَعْرِيرَةٌ عَنْ يَمِينِي، فَسَمِعْتُ قَائِلًا يَقُولُ: أَيْنَ ذَهَبْتَ بِهِ؟ قَالَ: إِلَى الْمَغْرِب * وَأَسْفَرَ ذٰلِكَ عَنِّي، ثُمَّ عَاوَدَنِي الرُّعْبُ وَالظُّلْمَةُ وَاْلقُشَعْرِيرَةُ عَنْ يَسَارِي، فَسَمِعْتُ قَائِلًا يَقُولُ: أَيْنَ ذَهَبْتَ بِهِ؟ قَالَ: إِلَى الْمَشْرِق * قَالَتْ: فَلَمْ يَزَلِ الْحَدِيثُ مِنِّي عَلَى بَالٍ حَتَّى ابْتَعَثَهُ اللَّه، فَكُنْتُ مِنْ أَوَّلِ النَّاسِ إِسْلَامًا *  وَكَمْ تَرْجَمَتِ السُّنَّةُ مِنْ عَظِيمِ الْمُعْجِزَات، وَبَاهِرِ الْآيَاتِ البَيِّنَات، بِمَا يَقْضِي بِعَظِيمِ شَرَفِهِ عِنْدَ مَوْلَاه، وَأَنَّ عَيْنَ عِنَايَتِهِ فِي كُلِّ حِينٍ تَرْعَاه، وَأَنَّهُ الْهَادِي إِلَى الصِّرَاطِ الْمُسْتَقِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "ثُمَّ إِنَّهُ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ بَعْدَ أَنْ حَكَمَتِ الْقُدْرَةُ بِظُهُورِه، وَانْتَشَرَتْ فِي الْأَكْوَانِ لَوَامِعُ نُورِه * تَسَابَقَتْ إِلَى رَضَاعِهِ الْمُرْضِعَات، وَتَوَفَّرَتْ رَغَبَاتُ أَهْلِ الْوُجُودِ فِي حَضَانَةِ هٰذِهِ الذَّات * فَنَفَذَ الْحُكْمُ مِنَ الْحَضْرَةِ الْعَظِيمَة، بِوَاسِطَةِ السَّوَابِقِ الْقَدِيمَة، بِأَنَّ الْأَوْلَى بِتَرْبِيَةِ هٰذَا الْحَبِيبِ وَحَضَانَتِهِ السَّيِّدَةُ حَلِيمَة * وَحِينَ لَاحَظَتْهُ عُيُونُهَا، وَبَرَزَ فِي شَأْنِهَا مِنْ أَسْرَارِ الْقُدْرَةِ الرَّبَّانِيَّةِ مَكْنُونُهَا، نَازَلَ قَلْبَهَا مِنَ الْفَرَحِ وَالسُّرُور، مَا دَلَّ عَلَى أَنَّ حَظَّهَا مِنَ الْكَرَامَةِ عِنْدَ اللَّهِ حَظٌّ مَوْفُور * فَحَنَتْ عَلَيْهِ حُنُوَّ الْأُمَّهَاتِ عَلَى الْبَنِين، وَرَغِبَتْ فِي رَضَاعِهِ طَمَعًا فِي نَيْلِ بَرَكَاتِهِ الَّتِي شَمِلَتِ الْعَالَمِين، فَطَلَبَتْ مِنْ أُمِّهِ الْكَرِيمَة، أَنْ تَتَوَلَّى رَضَاعَهُ وَحَضَانَتَهُ وَتَرْبِيَتَهُ بِالْعَيْنِ الرَّحِيمَة * فَأَجَابَتْهَا بِالتَّلْبِيَةِ لِدَاعِيهَا، لِمَا رَأَتْ مِنْ صِدْقِهَا فِي حُسْنِ التَّرْبِيَةِ وَوُفُورِ دَوَاعِيهَا * فَتَرَحَّلَتْ بِهِ إِلَى مَنَازِلِهَا مَسْرُورَة، وَهِيَ بِرِعَايَةِ اللَّهِ مَحْفُوفَةٌ وَبِعَيْنِ عِنَايَتِهِ مَنْظُورَة * فَشَاهَدَتْ فِي طَرِيقِهَا مِنْ غَرِيبِ الْمُعْجِزَات، مَا دَلَّهَا عَلَى أَنَّهُ أَشْرَفُ الْمَخْلُوقَات، فَقَدْ أَتَتْ وَشَارِفُهَا وَأَتَانُهَا ضَعِيفَتَان، وَرَجَعَتْ وَهُمَا لِدَوَابِّ الْقَافِلَةِ يَسْبِقَان، وَقَدْ دَرَّتِ الشَّارِفُ وَالشِّيَاهُ مِنَ الْأَلْبَان، بِمَا حَيَّرَ الْعُقُولَ وَالْأَذْهَان * وَبَقِيَ عِنْدَهَا فِي حَضَانَتِهَا وَزَوْجِهَا سَنَتَيْن، تَتَلَقَّى مِنْ بَرَكَاتِهِ وَعَجَائِبِ مُعْجِزَاتِهِ مَا تَقَرُّ بِهِ الْعَيْن، وَتَنْتَشِرُ أَسْرَارُهُ فِي الْكَوْنَيْن * حَتَّى وَاجَهَتْهُ مَلَائِكَةُ التَّخْصِيصِ وَالْإِكْرَام، بِالشَّرَفِ الَّذِي عَمَّتْ بَرَكَتُهُ الْأَنَام، وَهُوَ يَرْعَى الْأَغْنَام * فَأَضْجَعُوهُ عَلَى الْأَرْضِ إِضْجَاعَ تَشْرِيف، وَشَقُّوْا بَطْنَهُ شَقًّا لَطِيف، ثُمَّ أَخْرَجُوا مِنْ قَلْبِهِ مَا أَخْرَجُوه، وَأَوْدَعُوا فِيهِ مِنْ أَسْرَارِ الْعِلْمِ وَالْحِكْمَةِ مَا أَوْدَعُوه",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَمَا أَخْرَجَ الْأَمْلَاكُ مِنْ قَلْبِهِ أَذًى",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَلَكِنَّهُمْ زَادُوهُ طُهْرًا عَلَى طُهْرِ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "وَهُوَ مَعَ ذٰلِكَ فِي قُوَّةٍ وَثَبَات، يَتَصَفَّحُ مِنْ سُطُورِ الْقُدْرَةِ الْإِلٰهِيَّةِ بَاهِرَ الْآيَات * فَبَلَغَ إِلَى مُرْضَعَتِهِ الصَّالِحَةِ الْعَفِيفَة، مَا حَصَلَ عَلَى ذَاتِهِ الشَّرِيفَة، فَتَخَوَّفَتْ عَلَيْهِ مِنْ حَادِثٍ تَخْشَاه، وَلَمْ تَدْرِ أَنَّهُ مُلَاحَظٌ بِالْمُلَاحَظَةِ التَّامَّةِ مِنْ مَوْلَاه * فَرَدَّتْهُ إِلَى أُمِّهِ وَهِيَ غَيْرُ سَخِيَّةٍ بِفِرَاقِه، وَلَكِنْ لِمَا قَامَ مَعَهَا مِنْ حُزْنِ الْقَلْبِ عَلَيْهِ وَإِشْفَاقِه، وَهُوَ بِحَمْدِ اللَّهِ فِي حِصْنٍ مَانِعٍ وَمَقَامٍ كَرِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "فَنَشَأَ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ عَلَى أَكْمَلِ الْأَوْصَاف، يَحُفُّهُ مِنَ اللَّهِ جَمِيلُ الرِّعَايَةِ وَغَامِرُ الْأَلْطَاف * فَكَانَ يَشِبُّ فِي الْيَوْمِ شَبَابَ الصَّبِيِّ فِي الشَّهْر، وَيَظْهَرُ عَلَيْهِ فِي صِبَاهُ مِنْ شَرَفِ الْكَمَالِ مَا يَشْهَدُ لَهُ بِأَنَّهُ سَيِّدُ وَلَدِ آدَمَ وَلَا فَخْر * وَلَمْ يَزَلْ وَأَنْجُمُ سُعُودِهِ طَالِعَة، وَالْكَائِنَاتُ لِعَهْدِهِ حَافِظَةٌ وَلِأَمْرِهِ طَائِعَة * فَمَا نَفَثَ عَلَى مَرِيضٍ إِلَّا شَفَاهُ اللَّه، وَلَا تَوَجَّهَ فِي غَيْثٍ إِلَّا وَأَنْزَلَهُ مَوْلَاه * حَتَّى بَلَغَ مِنَ الْعُمْرِ أَشُدَّه، وَمَضَتْ لَهُ مِنْ سِنِّ الشَّبَابِ وَالْكُهُولَةِ مُدَّة، فَاجَأَتْهُ الْحَضْرَةُ الْإِلٰهِيَّةُ بِمَا شَرَّفَتْهُ بِهِ وَحْدَه * فَنَزَلَ عَلَيْهِ الرُّوحُ الْأَمِين، بِالْبُشْرَى مِنْ رَبِّ الْعَالَمِين، فَتَلَا عَلَيْهِ لِسَانُ الذِّكْرِ الْحَكِيم، شَاهِدَ: ﴿ وَإِنَّكَ لَتُلَقَّى ٱلْقُرْءَانَ مِن لَّدُنْ حَكِيمٍ عَلِيمٍ ﴾ * فَكَانَ أَوَّلَ مَا نَزَلَ عَلَيْهِ مِنْ تِلْكَ الْحَضْرَةِ مِنْ جَوَامِعِ الْحِكَم، قَوْلُهُ تَعَالَى: ﴿ ٱقْرَأْ بِٱسْمِ رَبِّكَ ٱلَّذِى خَلَقَ ۝ خَلَقَ ٱلْإِنسَـٰنَ مِنْ عَلَقٍ ۝ ٱقْرَأْ وَرَبُّكَ ٱلْأَكْرَمُ ۝ ٱلَّذِى عَلَّمَ بِٱلْقَلَمِ ۝ عَلَّمَ ٱلْإِنسَـٰنَ مَا لَمْ يَعْلَمْ ﴾ * فَمَا أَعْظَمَهَا مِنْ بِشَارَةٍ أَوْصَلَتْهَا يَدُ الْإِحْسَان، مِنْ حَضْرَةِ الاِمْتِنَان، إِلَى هَذَا الْإِنْسَان، وَأَيَّدَتْهَا بِشَارَةُ: ﴿ ٱلرَّحْمَـٰنُ ۝ عَلَّمَ ٱلْقُرْءَانَ ۝ خَلَقَ ٱلْإِنسَـٰنَ ۝ عَلَّمَهُ ٱلْبَيَانَ ﴾ * وَلَا شَكَّ أَنَّهُ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ هُوَ الْإِنْسَانُ الْمَقْصُودُ بِهٰذَا التَّعْلِيم، مِنْ حَضْرَةِ الرَّحْمٰنِ الرَّحِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "ثُمَّ إِنَّهُ بَعْدَ مَا نَزَلَ عَلَيْهِ الْوَحْيُ الْبَلِيغ، تَحَمَّلَ أَعْبَاءَ الدَّعْوَةِ وَالتَّبْلِيغ، فَدَعَا الْخَلْقَ إِلَى اللَّهِ عَلَى بَصِيرَة، فَأَجَابَهُ بِالْإِذْعَانِ مَنْ كَانَتْ لَهُ بَصِيرَةٌ مُنِيرَة * وَهِيَ إِجَابَةٌ سَبَقَتْ بِهَا الْأَقْضِيَةُ وَالْأَقْدَار، تَشَرّفَ بِالسَّبْقِ إِلَيْهَا الْمُهَاجِرُونَ وَالْأَنْصَار * وَقَدْ أَكْمَلَ اللَّهُ بِهِمَّةِ هٰذَا الْحَبِيبِ وَأَصْحَابِهِ هٰذَا الدِّين، وَأَكْبَتَ بِشِدَّةِ بَأْسِهِمْ قُلُوبَ الْكَافِرِينَ وَالْمُلْحِدِين * فَظَهَرَ عَلَى يَدَيْهِ مِنْ عَظِيمِ الْمُعْجِزَات، مَا يَدُلُّ عَلَى أَنَّهُ أَشْرَفُ أَهْلِ الْأَرْضِ وَالسَّمٰوَات * فَمِنْهَا: تَكْثِيرُ الْقَلِيل، وَبُرْءُ الْعَلِيل، وَتَسْلِيمُ الْحَجَر، وَطَاعَةُ الشَّجَر، وَانْشِقَاقُ الْقَمَر * وَالْإِخْبَارُ بِالْمُغَيَّبَات، وَحَنِينُ الْجِذْعِ الَّذِي هُوَ مِنْ خَوَارِقِ الْعَادَات، وَشَهَادَةُ الضَّبِّ لَهُ وَالْغَزَالَة، بِالنُّبُوَّةِ وَالرِّسَالَة * إِلَى غَيْرِ ذٰلِكَ مِنْ بَاهِرِ الْآيَات، وَغَرَائِبِ الْمُعْجِزَات، الَّتِي أَيَّدَهُ اللَّهُ بِهَا فِي رِسَالَتِه، وَخَصَّصَهُ بِهَا مِنْ بَيْنِ بَرِيَّتِه * وَقَدْ تَقَدَّمَتْ لَهُ قَبْلَ النُّبُوَّةِ إِرْهَاصَات، هِيَ عَلَى نُبُوَّتِهِ وَرِسَالَتِهِ مِنْ أَقْوَى الْعَلَامَات * وَمَعَ ظُهُورِهَا وَانْتِشَارِهَا سَعِدَ بِهَا الصَّادِقُونَ مِنَ الْمُؤْمِنِين، وَشَقِيَ بِهَا الْمُكَذِّبُونَ مِنَ الْكَافِرِينَ وَالْمُنَافِقِين * وَتَلَقَّاهَا بِالتَّصْدِيقِ وَالتَّسْلِيم، كُلُّ ذِي قَلْبٍ سَلِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "وَمِنَ الشَّرَفِ الَّذِي اخْتَصَّ اللَّهُ بِهِ أَشْرَفَ رَسُول، مِعْرَاجُهُ إِلَى حَضْرَةِ اللَّهِ الْبَرِّ الْوَصُول، وَظُهُورُ آيَاتِ اللَّهِ الْبَاهِرَةِ فِي ذٰلِكَ الْمِعْرَاج، وَتَشَرُّفُ السَّمٰوَاتِ وَمَنْ فَوْقَهُنَّ بِإِشْرَاقِ نُورِ ذٰلِكَ السِّرَاج * فَقَدْ عَرَجَ الْحَبِيبُ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ وَمَعَهُ الْأَمِينُ جِبْرِيل، إِلَى حَضْرَةِ الْمَلِكِ الْجَلِيل، مَعَ التَّشْرِيفِ وَالتَّبْجِيل، فَمَا مِنْ سَمَاءٍ وَلَجَهَا إِلَّا وَبَادَرَهُ أَهْلُهَا بِالتَّرْحِيبِ وَالتَّكْرِيمِ وَالتَّأْهِيل * وَكُلُّ رَسُولٍ مَرَّ عَلَيْه، بَشَرَّهُ بِمَا عَرَفَهُ مِنْ حَقِّهِ عِنْدَ اللَّهِ وَشَرِيفِ مَنْزِلَتِهِ لَدَيْه * حَتَّى جَاوَزَ السَّبْعَ الطِّبَاق، وَوَصَلَ إِلَى حَضْرَةِ الْإِطْلَاق، نَازَلَتْهُ مِنَ الْحَضْرَةِ الْإِلٰهِيَّة، غَوَامِرُ النَّفَحَاتِ الْقُرْبِيَّة * وَوَاجَهَتْهُ بِالتَّحِيَّات، وَأَكْرَمَتْهُ بِجَزِيلِ الْعَطِيَّات، وَأَوْلَتْهُ جَمِيلَ الْهِبَات، وَنَادَتْهُ بِشَرِيفِ التَّسْلِيمَات، بَعْدَ أَنْ أَثْنَى عَلَى تِلْكَ الْحَضْرَةِ بِ : التَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَات * فَيَا لَهَا مِنْ نَفَحَاتٍ غَامِرَات، وَتَجَلِّيَاتٍ عَالِيَاتٍ فِي حَضَرَاتٍ بَاهِرَات، تَشْهَدُ فِيهَا الذَّاتُ لِلذَّات، وَتَتَلَقَّى عَوَاطِفَ الرَّحَمَات، وَسَوَابِغَ الْفُيُوضَات، بِأَيْدِي الْخُضُوعِ وَالْإِخْبَات",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "رُتَبٌ تَسْقُطُ الْأَمَانِيُّ حَسْرَى",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "دُونَهَا مَا وَرَاءَهُنَّ وَرَاءُ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "عَقَلَ الْحَبِيبُ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ فِي تِلْكَ الْحَضْرَةِ مِنْ سِرِّهَا مَا عَقَل، وَاتَّصَلَ مِنْ عِلْمِهَا بِمَا اتَّصَل، ﴿ فَأَوْحَىٰٓ إِلَىٰ عَبْدِهِۦ مَآ أَوْحَىٰ ۝ مَا كَذَبَ ٱلْفُؤَادُ مَا رَأَىٰٓ ﴾ * فَمَا هِيَ إِلَّا مِنْحَةٌ خَصَّصَتْ بِهَا حَضْرَةُ الاِمْتِنَان، هٰذَا الْإِنْسَان، وَأَوْلَتْهُ مِنْ عَوَاطِفِهَا الرَّحِيمةِ مَا يَعْجِزُ عَنْ حَمْلِهِ الثَّقَلَان * وَتِلْكَ مَوَاهِبُ لَا يَجْسُرُ الْقَلَمُ عَلَى شَرْحِ حَقَائِقِهَا، وَلَا تَسْتَطِيعُ الْأَلْسُنُ أَنْ تُعْرِبَ عَنْ خَفِيِّ دَقَائِقِهَا. خَصَّصَتْ بِهَا الْحَضْرَةُ الْوَاسِعَة، هَذِهِ الْعَيْنَ النَّاظِرَةَ وَالْأُذُنَ السَّامِعَة * فَلَا يَطْمَعُ طَامِعٌ فِي الاِطِّلَاعِ عَلَى مَسْتُورِهَا، وَالْإِحَاطَةِ بِشُهُودِ نُورِهَا، فَإِنَّهَا حَضْرَةٌ جَلَّتْ عَنْ نَظَرِ النَّاظِرِين، وَرُتْبَةٌ عَزَّتْ عَلَى غَيْرِ سَيِّدِ الْمُرْسَلِين * فَهَنِيئًا لِلْحَضْرَةِ الْمُحَمَّدِيَّة، مَا وَاجَهَهَا مِنْ عَطَايَا الْحَضْرَةِ الْأَحَدِيَّة، وَبُلُوغُهَا إِلَى هٰذَا الْمَقَامِ الْعَظِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "وَحَيْثُ تَشَرَّفَتِ الْأَسْمَاعُ بِأَخْبَارِ هٰذَا الْحَبِيبِ الْمَحْبُوب، وَمَا حَصَلَ لَهُ مِنَ الْكَرَامَةِ فِي عَوَالِمِ الشَّهَادَةِ وَالْغُيُوب * تَحَرَّكَتْ هِمَّةُ الْمُتَكَلِّمِ إِلَى نَشْرِ مَحَاسِنِ خَلْقِ هٰذَا السَّيِّدِ وَأَخْلَاقِه، لِيَعْرِفَ السَّامِعُ مَا أَكْرَمَهُ اللَّهُ بِهِ مِنَ الْوَصْفِ الْحَسَنِ وَالْخَلْقِ الْجَمِيلِ الَّذِي خَصَّصَتْهُ بِهِ عِنَايَةُ خَلَّاقِه * فَلْيُقَابِلِ السَّامِعُ مَا أُمْلِيهِ عَلَيْهِ مِنْ شَرِيفِ الْأَخْلَاقِ بِأُذُنٍ وَاعِيَة، فَإِنَّهُ سَوْفَ يَجْمَعُهُ مِنْ أَوْصَافِ الْحَبِيبِ عَلَى الرُّتْبَةِ الْعَالِيَة.  فَلَيْسَ يُشَابِهُ هٰذَا السَّيِّدَ فِي خَلْقِهِ وَأَخْلَاقِهِ بَشَر، وَلَا يَقِفُ أَحَدٌ مِنْ أَسْرَارِ حِكْمَةِ اللَّهِ فِي خَلْقِهِ وَخُلُقِهِ عَلَى عَيْنٍ وَلَا أَثَر * فَإِنَّ الْعِنَايَةَ الْأَزَلِيَّة، طَبَعَتْهُ عَلَى أَخْلَاقٍ سَنِيَّة، وَأَقَامَتْهُ فِي صُورَةٍ حَسَنَةٍ بَدْرِيَّة * فَلَقَدْ كَانَ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ مَرْبُوعَ الْقَامَة، أَبْيَضَ اللَّوْنِ مُشَرَّبًا بِحُمْرَة، وَاسِعَ الْجَبِين، حَسَنَهُ، شَعَرُهُ بَيْنَ الْجُمَّةِ وَالْوَفْرَة * وَلَهُ الاِعْتِدَالُ الْكَامِلُ فِي مَفَاصِلِهِ وَأَطْرَافِه، وَالاِسْتِقَامَةُ الْكَامِلَةُ فِي مَحَاسِنِهِ وَأَوْصَافِه * لَمْ يَأْتِ بَشَرٌ عَلَى مِثْلِ خَلْقِه، فِي مَحَاسِنِ نَظَرِهِ وَسَمْعِهِ وَنُطْقِه، قَدْ خَلَقَهُ اللَّهُ عَلَى أَجْمَلِ صُورَة، فِيهَا جَمِيعُ الْمَحَاسِنِ مَحْصُورَة، وَعَلَيْهَا مَقْصُورَة * إِذَا تَكَلَّمَ نَثَرَ مِنَ الْمَعَارِفِ وَالْعُلُومِ نَفَائِسَ الدُّرَر، وَلَقَدْ أُوتِيَ مِنْ جَوَامِعِ الْكَلِمِ مَا عَجَزَ عَنِ الْإِتْيَانِ بِمِثْلِهِ مَصَاقِعُ الْبُلَغَاءِ مِنَ الْبَشَر، تَتَنَزَّهُ الْعُيُونُ فِي حَدَائِقِ مَحَاسِنِ جَمَالِه، فَلَا تَجِدُ مَخْلُوقًا فِي الْوُجُودِ عَلَى مِثَالِه",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "سَيِّدٌ ضِحْكُهُ التَّبَسُّمُ وَالْمَشْــ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "ــيُ الْهُوَيْنَا وَنَوْمُهُ الْإِغْفَاءُ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "مَا سِوَى خُلْقِهِ النَّسِيمُ وَلَا غَيْــ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "ــرُ مُحَيَّاهُ الرَّوْضَةُ الْغَنَّاءُ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "رَحْمَةٌ كُلُّهُ وَحَزْمٌ وَعَزْمٌ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَوَقَارٌ وَعِصْمَةٌ وَحَيَاءُ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "مُعْجِزُ الْقَوْلِ وَالْفِعَالِ كَرِيمُ الْــ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "ــخَلْقِ وَالْخُلْقِ مُقْسِطٌ مِعْطَاءُ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "وَإِذَا مَشَى فَكَأَنَّمَا يَنْحَطُّ مِنْ صَبَب، فَيَفُوتُ سَرِيعَ الْمَشْيِ مِنْ غَيْرِ خَبَب * فَهُوَ الْكَنْزُ الْمُطَلْسَمُ الَّذِي لَا يَأْتِي عَلَى فَتْحِ بَابِ أَوْصَافِهِ مِفْتَاح، وَالْبَدْرُ التِّمُّ الَّذِي يَأْخُذُ الْأَلْبَابَ إِذَا تَخَيَّلَتْهُ أَوْ سَنَاهُ لَهَا لَاح",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "حَبِيبٌ يَغَارُ الْبَدْرُ مِنْ حُسْنِ وَجْهِهِ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "تَحَيَّرَتِ الْأَلْبَابُ فِي وَصْفِ مَعْنَاهُ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "فَمَاذَا يُعْرِبُ الْقَوْلُ عَنْ وَصْفٍ يُعْجِزُ الْوَاصِفِين، أَوْ يُدْرِكُ الْفَهْمُ مَعْنَى ذَاتٍ جَلَّتْ أَنْ يَكُونَ لَهَا فِي وَصْفِهَا مُشَارِكٌ أَوْ قَرِين",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "كَمُلَتْ مَحَاسِنُهُ فَلَوْ أَهْدَى السَّنَا",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "لِلْبَدْرِ عِنْدَ تَمَامِهِ لَمْ يُخْسَفِ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَعَلَى تَفَنُّنِ وَاصِفِيهِ بِوَصْفِهِ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "يَفْنَى الزَّمَانُ وَفِيهِ مَا لَمْ يُوصَفِ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "فَمَا أَجَلَّ قَدْرَهُ الْعَظِيم، وَأَوْسَعَ فَضْلَهُ الْعَمِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "وَلَقَدِ اتَّصَفَ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ مِنْ مَحَاسِنِ الْأَخْلَاق، بِمَا تَضِيقُ عَنْ كِتَابَتِهِ بُطُونُ الْأَوْرَاق * كَانَ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ أَحْسَنَ النَّاسِ خُلُقًا وَخَلْقًا، وَأَوَّلَهُمْ إِلَى مَكَارِمِ الْأَخْلَاقِ سَبْقًا، وَأَوْسَعَهُمْ بِالْمُؤْمِنِينَ حِلْمًا وَرِفْقًا * بَرًّا رَؤُوفًا، لَا يَقُولُ وَلَا يَفْعَلُ إِلَّا مَعْرُوفًا، لَهُ الْخُلُقُ السَّهْل، وَاللَّفْظُ الْمُحْتَوِي عَلَى الْمَعْنَى الْجَزْل * إِذَا دَعَاهُ الْمِسْكِينُ أَجَابَهُ إِجَابَةً مُعَجَّلَة، وَهُوَ الْأَبُ الشَّفِيقُ الرَّحِيمُ لِلْيَتِيمِ وَالْأَرْمَلَة * وَلَهُ مَعَ سُهُولَةِ أَخْلَاقِهِ الْهَيْبَةُ الْقَوِيَّة، الَّتِي تَرْتَعِدُ مِنْهَا فَرَائِصُ الْأَقْوِيَاءِ مِنَ الْبَرِيَّة * وَمِنْ نَشْرِ طِيبِهِ تَعَطَّرَتِ الطُّرُقُ وَالْمَنَازِل، وَبِعَرْفِ ذِكْرِهِ تَطَيَّبَتِ الْمَجَالِسُ وَالْمَحَافِل * فَهُوَ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ جَامِعُ الصِّفَاتِ الْكَمَالِيَّة، وَالْمُنْفَرِدُ فِي خَلْقِهِ وَخُلُقِهِ بِأَشْرَفِ خُصُوصِيَّة * فَمَا مِنْ خُلُقٍ فِي الْبَرِيَّةِ مَحْمُود، إِلَّا وَهُوَ مُتَلَقًّى عَنْ زَيْنِ الْوُجُود",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَجْمَلْتُ فِي وَصْفِ الْحَبِيبِ وَشَأْنِهِ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "وَلَهُ الْعُلَا فِي مَجْدِهِ وَمَكَانِهِ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَوْصَافُ عِزٍّ قَدْ تَعَالَى مَجْدُهَا",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "أَخَذَتْ عَلَى نَجْمِ السُّهَا بِعِنَانِهِ",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "وَقَدِ انْبَسَطَ الْقَلَمُ فِي تَدْوِينِ مَا أَفَادَهُ الْعِلْمُ مِنْ وَقَائِعِ مَوْلِدِ النَّبِيِّ الْكَرِيم، وَحِكَايَةِ مَا أَكْرَمَ اللَّهُ بِهِ هٰذَا الْعَبْدَ الْمُقَرَّبَ مِنَ التَّكْرِيمِ وَالتَّعْظِيمِ وَالْخُلُقِ الْعَظِيم * فَحَسُنَ مِنِّي أَنْ أُمْسِكَ أَعِنَّةَ الْأَقْلَام، فِي هٰذَا الْمَقَام، وَأَقْرَأَ السَّلَام، عَلَى سَيِّدِ الْأَنَام",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic: "{السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهْ} (ثَلَاثًا)",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "وَبِذَلِكَ يَحْسُنُ الْخَتْمُ كَمَا يَحْسُنُ التَّقْدِيم، فَعَلَيْهِ أَفْضَلُ الصَّلَاةِ وَالتَّسْلِيم",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "(اللَّهُمَّ صَلِّ وَسَلِّمْ أَشْرَفَ الصَّلَاةِ وَالتَّسْلِيم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ الرَّؤُوفِ الرَّحِيم)",
            translit: "",
            translation: "",
          }),
        ],
      }),
      new QasidaVerseModel({
        chorus: false,
        entries: [
          new QasidaEntryModel({
            arabic:
              "وَلَمَّا نَظَمَ الْفِكْرُ مِنْ دَرَارِيِّ الْأَوْصَافِ الْمُحَمَّدِيَّةِ عُقُودًا، تَوَجَّهْتُ إِلَى اللَّهِ مُتَوَسِّلًا بِسَيِّدِي وَحَبِيبِي مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ أَنْ يَجْعَلَ سَعْيِي فِيهِ مَشْكُورًا وَفِعْلِي فِيهِ مَحْمُودًا * وَأَنْ يَكْتُبَ عَمَلِي فِي الْأَعْمَالِ الْمَقْبُولَة، وَتَوَجُّهِي فِي التَّوَجُّهَاتِ الْخَالِصَةِ وَالصِّلَاتِ الْمَوْصُولَة * اللَّهُمَّ ؛ يَا مَنْ إِلَيْهِ تَتَوَجَّهُ الْآمَالُ فَتَعُودُ ظَافِرَة، وَعَلَى بَابِ عِزَّتِهِ تُحَطُّ الرِّحَالُ فَتَغْشَاهَا مِنْهُ الْفُيُوضَاتُ الْغَامِرَة، نَتَوَجَّهُ إِلَيْك، بِأَشْرَفِ الْوَسَائِلِ لَدَيْك * سَيِّدِ الْمُرْسَلِين، عَبْدِكَ الصَّادِقِ الْأَمِين، سَيِّدِنَا مُحَمَّدٍ الَّذِي عَمَّتْ رِسَالَتُهُ الْعَالَمِين * أَنْ تُصَلِّيَ وَتُسَلِّمَ عَلَى تِلْكَ الذَّاتِ الْكَامِلَة، مُسْتَوْدَعِ أَمَانَتِك، وَحَفِيظِ سِرِّك، وَحَامِلِ رَايَةِ دَعْوَتِكَ الشَّامِلَة * الْأَبِ الْأَكْبَر، الْمَحْبُوبِ لَكَ وَالْمُخَصَّصِ بِالشَّرَفِ الْأَفْخَر، فِي كُلِّ مَوْطِنٍ مِنْ مَوَاطِنِ الْقُرْبِ وَمَظْهَر * قَاسِمِ إِمْدَادِكَ فِي عِبَادِك، وَسَاقِي كُؤُوسِ إِرْشَادِكَ لِأَهْلِ وِدَادِك * سَيِّدِ الْكَوْنَيْن، وَأَشْرَفِ الثَّقَلَيْن، الْعَبْدِ الْمَحْبُوبِ الْخَالِص، الْمَخْصُوصِ مِنْكَ بِأَجَلِّ الْخَصَائِص * اللَّهُمَّ ؛ صَلِّ وَسَلِّمْ عَلَيْهِ وَعَلَى آلِهِ وَأَصْحَابِه، وَأَهْلِ حَضْرَةِ اقْتِرَابِهِ مِنْ أَحْبَابِه",
            translit: "",
            translation: "",
          }),
          new QasidaEntryModel({
            arabic:
              "اللَّهُمَّ ؛ إِنَّا نُقَدِّمُ إِلَيْكَ جَاهَ هٰذَا النَّبِيِّ الْكَرِيم، وَنَتَوَسَّلُ إِلَيْكَ بِشَرَفِ مَقَامِهِ الْعَظِيم * أَنْ تُلَاحِظَنَا فِي حَرَكَاتِنَا وَسَكَنَاتِنَا بِعَيْنِ عِنَايَتِك، وَأَنْ تَحْفَظَنَا فِي جَمِيعِ أَطْوَارِنَا وَتَقَلُّبَاتِنَا بِجَمِيلِ رِعَايَتِك، وَحَصِينِ وِقَايَتِك * وَأَنْ تُبَلِّغَنَا مِنْ شَرَفِ الْقُرْبِ إِلَيْكَ وَإِلَى هٰذَا الْحَبِيبِ غَايَةَ آمَالِنَا، وَتَتَقَبَّلَ مِنَّا مَا تَحَرَّكْنَا فِيهِ مِنْ نِيَّاتِنَا وَأَعْمَالِنَا * وَتَجْعَلَنَا فِي حَضْرَةِ هٰذَا الْحَبِيبِ مِنَ الْحَاضِرِين، وَفِي طَرَائِقِ اتِّبَاعِه مِنَ السَّالِكِين، وَلِحَقِّكَ وَحَقِّهِ مِنَ الْمُؤَدِّين، وَلِعَهْدِكَ مِنَ الْحَافِظِين * اللَّهُمَّ ؛ إِنَّ لَنَا أَطْمَاعًا فِي رَحْمَتِكَ الْخَاصَّةِ فَلَا تَحْرِمْنَا، وَظُنُونًا جَمِيلَةً هِيَ وَسِيلَتُنَا إِلَيْكَ فَلَا تُخَيِّبْنَا * آمَنَّا بِكَ وَبِرَسُولِكَ وَمَا جَاءَ بِهِ مِنَ الدِّين، وَتَوَجَّهْنَا بِهِ إِلَيْكَ مُسْتَشْفِعِين * أَنْ تُقَابِلَ الْمُذْنِبَ مِنَّا بِالْغُفْرَان، وَالْمُسِيءَ بِالْإِحْسَان، وَالسَّائِلَ بِمَا سَأَل، وَالْمُؤَمِّلَ بِمَا أَمَّل * وَأَنْ تَجْعَلَنَا مِمَّنْ نَصَرَ هٰذَا الْحَبِيبَ وَوَازَرَه، وَوَالَاهُ وَظَاهَرَه * وَعُمَّ بِبَركَتِهِ وَشَرِيفِ وِجْهَتِهِ أَوْلَادَنَا وَوَالِدِينَا، وَأَهْلَ قُطْرِنَا وَوَادِينَا * وَجَمِيعَ الْمُسْلِمِينَ وَالْمُسْلِمَات، وَالْمُؤْمِنِينَ وَالْمُؤْمِنَات، فِي جَمِيعِ الْجِهَات * وَأَدِمْ رَايَةَ الدِّينِ الْقَوِيمِ فِي جَمِيعِ الْأَقْطَارِ مَنْشُورَة، وَمَعَالِمَ الْإِسْلَامِ وَالْإِيمَانِ بِأَهْلِهَا مَعْمُورَة، مَعْنًى وَصُورَة * وَاكْشِفِ اللَّهُمَّ كُرْبَةَ الْمَكْرُوبِين، وَاقْضِ دَيْنَ الْمَدِيْنِين، وَاغْفِرْ لِلْمُذْنِبِين، وَتَقَبَّلْ تَوْبَةَ التَّائِبِين، وَانْشُرْ رَحْمَتَكَ عَلَى عِبَادِكَ الْمُؤْمِنِينَ أَجْمَعِين، وَاكْفِ شَرَّ الْمُعْتَدِينَ وَالظَّالِمِين * وَابْسُطِ الْعَدْلَ بِوُلَاةِ الْحَقِّ فِي جَميعِ النَّوَاحِي وَالْأَقْطَار، وَأَيِّدْهُمْ بِتَأْيِيدٍ مِنْ عِنْدِكَ وَنَصْرٍ عَلَى الْمُعَانِدِينَ مِنَ الْمُنَافِقِينَ وَالْكُفَّار * وَاجْعَلْنَا يَا رَبِّ فِي الْحِصْنِ الْحَصِينِ مِنْ جَمِيعِ الْبَلَايَا، وَفِي الْحِرْزِ الْمَكِينِ مِنَ الذُّنُوبِ وَالْخَطَايَا * وَأَدِمْنَا فِي الْعَمَلِ بِطَاعَتِكَ وَالصِّدْقِ فِي خِدْمَتِكَ قَائِمِين، وَإِذَا تَوَفَّيْتَنَا فَتَوَفَّنَا مُسْلِمِينَ مُؤْمِنِين، وَاخْتِمْ لَنَا مِنْكَ بِخَيْرٍ أَجْمَعِين * وَصَلِّ وَسَلِّمْ عَلَى هٰذَا الْحَبِيبِ الْمَحْبُوب، لِلْأَجْسَامِ وَالْأَرْوَاحِ وَالْقُلُوب، وَعَلَى آلِهِ وَصَحْبِهِ وَمَنْ إِلَيْهِ مَنْسُوب * وَآخِرُ دَعْوَانَا أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِين",
            translit: "",
            translation: "",
          }),
        ],
      }),
    ],
  }),
];
